---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailingType
source: html/7e7551fe-1772-f2d3-a8b5-58d4bb42a34e.htm
---
# Autodesk.Revit.DB.Architecture.RailingType

An object supporting management of baluster and post placement within the railing type.

## Syntax (C#)
```csharp
public class RailingType : ElementType
```